["Sacrifice: Fed to specially consecrated beasts/Savaged (eaten?) by frenzied cult mob.", "Sacrifice: Pitted against an anointed champion in death arena.", "Sacrifice: Ritually bled upon the sacred altar.", "Sacrifice: Progressively overdosed with mind-expanding drugs.", "Sacrifice: Ritually killed and claimed as anointed spirit-champion.", "Sacrifice: Slain by arcane means (electrocuted, spirit shattered, death-cursed).", "Congregation: An orgy of pleasure (sex, food, dance, music) and/or pain.", "Congregation: Sacred hymns or prayers for days without ceasing.", "Congregation: Occupying a sacred nexus point during an astrological confluence.", "Congregation: A pilgrimage to a sacred place or being in the deathlands/at sea.", "Congregation: A group vision/dream-quest via essences, drugs, or meditation.", "Congregation: A reenactment/dumb-show of a sacred event.", "Acquisition: A collection of eyes/hearts/blood from mystics or demons.", "Acquisition: The shards of a shattered sacred object (jewel, sword, skull, stone).", "Acquisition: The original holy writings of the prophet/master/saint.", "Acquisition: The severed body parts (heads, hands, tongues) of heretics or apostates.", "Acquisition: Properties aligned with sacred geometry or attuned by mystical events.", "Acquisition: The ghosts of prophets/mystics/founders/enemies of the order.", "Destruction: Ritual burning of sacred objects (rune-papers, effigies, flesh, hair).", "Destruction: Ritual eradication of a spirit or demon.", "Destruction: The breaking of the seals that keep the god from this world.", "Destruction: Shattering of ritual objects/altars/temples sacred to an enemy order.", "Destruction: Eradication of weapons/objects/sites/rituals that can harm the god.", "Destruction: Eradication of social/legal/cultural elements that threaten the order.", "Consecration: Purifcation by bathing in sacred fluid (blood, wine, milk, oil, etc.).", "Consecration: Purifcation of the gates that give passage to the god into this world.", "Consecration: Baptism/blessing of an acolyte or object by immersion in spirit well.", "Consecration: Purify/bless cult followers with tattoos/scarifcation/mutilation.", "Consecration: Creation of blessed idols/artwork/ritual spaces/artifacts.", "Consecration: Wards/runes/spirits bound to shun enemies of the order.", "Desecration: Debasement or deflement of one sworn to an enemy order.", "Desecration: Corruption of place/object/ritual/tradition to appropriate its power.", "Desecration: Deflement of place/object/ritual to humiliate another order.", "Desecration: Manipulation of authorities/institutions to appropriate their power.", "Desecration: Corruption of acolytes to prepare them for transformation.", "Desecration: Mindless, pointless chaos; sewing the seeds of anarchy."]